src/test/resources/response/createSubscriptionResponse.json

{

  "success": true,
  "responseStatus": "OK",
  "message": "Request processed successfully.",
  "data": {
    "shipTo": {
      "name": {
        "firstName": "Jitendra",
        "middleName": "D",
        "lastName": "Pisal"
      },
      "streetAddress": {
        "street1": "27 O ST",
        "street2": "Boston road"
      },
      "id": "60cb0959dc645c0008eb9c1a",
      "city": "BOSTON MA",
      "state": "MA",
      "zipCode": "02127",
      "country": "US"
    },
    "billTo": {
      "name": {
        "firstName": "Jitendra",
        "middleName": "D",
        "lastName": "Pisal"
      },
      "streetAddress": {
        "street1": "27 O ST",
        "street2": "Boston road"
      },
      "city": "BOSTON MA",
      "state": "MA",
      "zipCode": "02127",
      "country": "US",
      "id": "60cb0986559fbd000816afc2"
    },
    "paymentDetails": {
      "processor": "stripe"
    },
    "retryCount": 0,
    "tags": [

    ],
    "channel": "WEBSITE",
    "itemAttributes": null,
    "isGift": false,
    "_id": "61c179573800d300098927df",
    "isDeleted": false,
    "deletedAt": null,
    "planID": "61c179335d772100085a2a53",
    "itemID": "1000011327",
    "childItems": [
      {
        "_id": "61c179573800d300098927e0"
      }
    ],
    "priceListID": "111544",
    "quantity": 1,
    "customerID": "61c179573800d300098927db",
    "frequency": 1,
    "frequencyType": "Weekly",
    "merchantAccount": "5f689caa4216e7000750d1ef",
    "status": "ACTIVE",
    "lastOrderReferenceId": "6803-5058-20875",
    "cancellationReason": "",
    "discount": 10,
    "tax": 2,
    "shippingCost": 10,
    "paymentMethod": "pm_1J3GhuJxr7zyIFb92eU5RsY3",
    "lastPaymentDate": "2021-12-21T06:51:03.039Z",
    "nextPaymentDate": "2021-12-28T10:00:01.199Z",
    "payments": {
      "billToAddress": {
        "name": {
          "first": "Jitendra",
          "last": "Pisal"
        },
        "phone": {
          "number": "4156529712",
          "kind": "mobile"
        },
        "email": "jitendra.pisal1@fabric.inc",
        "street1": "27 O ST",
        "street2": "Boston road",
        "city": "BOSTON MA",
        "state": "MA",
        "country": "US",
        "zipCode": "02127"
      },
      "shipToId": [
        2866
      ],
      "_id": "60cb0986559fbd000816afc2",
      "paymentStatus": "succeeded",
      "amount": 127.45,
      "currency": "USD",
      "paymentIdentifier": {
        "cardIdentifier": "4242"
      },
      "paymentMethod": "visa",
      "paymentKind": "CARD_PAYPAL",
      "conversion": 1,
      "paymentToken": {
        "token": "pi_1J3GhrJxr7zyIFb9ooMrxEcp",
        "type": "CARD_STRIPE"
      }
    },
    "expireDate": "2021-12-22T00:00:00.199Z",
    "billingFrequencySetting": {
      "frequency": 1,
      "frequencyType": "Weekly"
    },
    "shippingFrequencySetting": {
      "frequency": 1,
      "frequencyType": "Weekly"
    },
    "nextShipDate": "2021-12-28T10:00:01.199Z",
    "createdAt": "2021-12-21T06:51:03.045Z",
    "updatedAt": "2021-12-21T06:51:03.045Z",
    "__v": 0
  }
}